{
  "companies": [
    {
      "company": "Microsoft",
      "provided_aid": "Deployed patches against a targeted \"wiper\" malware used against Ukrainian authorities, placing their Threat Intelligence Center on high alert for such attacks. It has provided over $400 million worth of support from cloud service, cybersecurity to humanitarian aid."
    },
    {
      "company": "Google",
      "provided_aid": "Provided $2M in donated ads to help those affected find resources."
    },
    {
      "company": "KFC",
      "provided_aid": "Opened their kitchens to prepare food for those in need, especially for the military and hospitals"
    },
    {
      "company": "McDonalds",
      "provided_aid": "Donated food to local councils to be distributed to those in need, including water, vegetables, fruit, eggs, rolls, and salads."
    },
    {
      "company": "SpaceX",
      "provided_aid": "Activated Starlink satellite-based internet service in Ukraine and sent thousands of user terminals."
    },
    {
      "company": "Bolt",
      "provided_aid": "Bolt will donate 5 million EUR = 5% of every order in Europe to Non-Governmental Organisations (NGOs)"
    },
    {
      "company": "Lego",
      "provided_aid": "110 million DKK for humanitarian aid via Red Cross, Save the Children and UNICEF. 100 million DKK for rebuilding Ukraine's education system and educating Ukrainian child refugees in Europe."
    },
    {
      "company": "Philip Morris International",
      "provided_aid": "Donated 500,000 packs of cigarettes to the Ukrainian military."
    },
    {
      "company": "CD Projekt RED",
      "provided_aid": "Suspended all sales in Russia and Belarus, and donated $242,000 to humanitarian aid in Ukraine."
    },
    {
      "company": "Baykar",
      "provided_aid": "Donated three Baykar Bayraktar TB2-type UAVs to Ukraine."
    },
    {
      "company": "Kel-Tec",
      "provided_aid": "Pledged to donate 400 SUB-2000 semi-automatic carbines valued at $200,000 to the Ukrainian Armed Forces."
    },
    {
      "company": "Wizz Air",
      "provided_aid": "Provided 100,000 airline tickets free of charge, to refugees, for short-distance flights from Poland, Slovakia, Hungary and Romania in March 2022."
    }
  ]
}